[command]/home/runner/work/_temp/a369d098-090f-4646-af5a-bc1fc51c8e84/terraform-bin plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_instance.web[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_instance" "web" {
      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-006cfe9f763a1cb77"
      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_stop[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false
      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mhost_resource_group_arn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0miam_instance_profile[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0minstance_lifecycle[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t3.micro"
      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mplacement_partition_number[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true
      [32m+[0m [0m[1m[0mspot_instance_request_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {
          [32m+[0m [0m"Name" = "HelloWorld"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {
          [32m+[0m [0m"Name" = "HelloWorld"
        }
      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0muser_data[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0muser_data_replace_on_change[0m[0m          = false
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = (known after apply)

      [32m+[0m [0mcapacity_reservation_specification {
          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)

          [32m+[0m [0mcapacity_reservation_target {
              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mcapacity_reservation_resource_group_arn[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mcpu_options {
          [32m+[0m [0m[1m[0mamd_sev_snp[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mcore_count[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mthreads_per_core[0m[0m = (known after apply)
        }

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [32m+[0m [0menclave_options {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mephemeral_block_device {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)
        }

      [32m+[0m [0minstance_market_options {
          [32m+[0m [0m[1m[0mmarket_type[0m[0m = (known after apply)

          [32m+[0m [0mspot_options {
              [32m+[0m [0m[1m[0minstance_interruption_behavior[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmax_price[0m[0m                      = (known after apply)
              [32m+[0m [0m[1m[0mspot_instance_type[0m[0m             = (known after apply)
              [32m+[0m [0m[1m[0mvalid_until[0m[0m                    = (known after apply)
            }
        }

      [32m+[0m [0mmaintenance_options {
          [32m+[0m [0m[1m[0mauto_recovery[0m[0m = (known after apply)
        }

      [32m+[0m [0mmetadata_options {
          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp_protocol_ipv6[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0minstance_metadata_tags[0m[0m      = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_card_index[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)
        }

      [32m+[0m [0mprivate_dns_name_options {
          [32m+[0m [0m[1m[0menable_resource_name_dns_a_record[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhostname_type[0m[0m                        = (known after apply)
        }

      [32m+[0m [0mroot_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create%0A[0m%0ATerraform will perform the following actions:%0A%0A[1m  # aws_instance.web[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "aws_instance" "web" {%0A      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-006cfe9f763a1cb77"%0A      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)%0A      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = (known after apply)%0A      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mdisable_api_stop[0m[0m                     = (known after apply)%0A      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false%0A      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0mhost_resource_group_arn[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0miam_instance_profile[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_lifecycle[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t3.micro"%0A      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = (known after apply)%0A      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0mplacement_partition_number[0m[0m           = (known after apply)%0A      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)%0A      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true%0A      [32m+[0m [0m[1m[0mspot_instance_request_id[0m[0m             = (known after apply)%0A      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {%0A          [32m+[0m [0m"Name" = "HelloWorld"%0A        }%0A      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {%0A          [32m+[0m [0m"Name" = "HelloWorld"%0A        }%0A      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data_replace_on_change[0m[0m          = false%0A      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = (known after apply)%0A%0A      [32m+[0m [0mcapacity_reservation_specification {%0A          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mcapacity_reservation_target {%0A              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m                 = (known after apply)%0A              [32m+[0m [0m[1m[0mcapacity_reservation_resource_group_arn[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mcpu_options {%0A          [32m+[0m [0m[1m[0mamd_sev_snp[0m[0m      = (known after apply)%0A          [32m+[0m [0m[1m[0mcore_count[0m[0m       = (known after apply)%0A          [32m+[0m [0m[1m[0mthreads_per_core[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mebs_block_device {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)%0A          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)%0A        }%0A%0A      [32m+[0m [0menclave_options {%0A          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mephemeral_block_device {%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)%0A          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0minstance_market_options {%0A          [32m+[0m [0m[1m[0mmarket_type[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mspot_options {%0A              [32m+[0m [0m[1m[0minstance_interruption_behavior[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mmax_price[0m[0m                      = (known after apply)%0A              [32m+[0m [0m[1m[0mspot_instance_type[0m[0m             = (known after apply)%0A              [32m+[0m [0m[1m[0mvalid_until[0m[0m                    = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mmaintenance_options {%0A          [32m+[0m [0m[1m[0mauto_recovery[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mmetadata_options {%0A          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_protocol_ipv6[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)%0A          [32m+[0m [0m[1m[0minstance_metadata_tags[0m[0m      = (known after apply)%0A        }%0A%0A      [32m+[0m [0mnetwork_interface {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_card_index[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)%0A        }%0A%0A      [32m+[0m [0mprivate_dns_name_options {%0A          [32m+[0m [0m[1m[0menable_resource_name_dns_a_record[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mhostname_type[0m[0m                        = (known after apply)%0A        }%0A%0A      [32m+[0m [0mroot_block_device {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)%0A          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)%0A        }%0A    }%0A%0A[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create%0A[0m%0ATerraform will perform the following actions:%0A%0A[1m  # aws_instance.web[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "aws_instance" "web" {%0A      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-006cfe9f763a1cb77"%0A      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)%0A      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = (known after apply)%0A      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mdisable_api_stop[0m[0m                     = (known after apply)%0A      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false%0A      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0mhost_resource_group_arn[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0miam_instance_profile[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_lifecycle[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t3.micro"%0A      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = (known after apply)%0A      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0mplacement_partition_number[0m[0m           = (known after apply)%0A      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)%0A      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true%0A      [32m+[0m [0m[1m[0mspot_instance_request_id[0m[0m             = (known after apply)%0A      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {%0A          [32m+[0m [0m"Name" = "HelloWorld"%0A        }%0A      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {%0A          [32m+[0m [0m"Name" = "HelloWorld"%0A        }%0A      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data_replace_on_change[0m[0m          = false%0A      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = (known after apply)%0A%0A      [32m+[0m [0mcapacity_reservation_specification {%0A          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mcapacity_reservation_target {%0A              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m                 = (known after apply)%0A              [32m+[0m [0m[1m[0mcapacity_reservation_resource_group_arn[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mcpu_options {%0A          [32m+[0m [0m[1m[0mamd_sev_snp[0m[0m      = (known after apply)%0A          [32m+[0m [0m[1m[0mcore_count[0m[0m       = (known after apply)%0A          [32m+[0m [0m[1m[0mthreads_per_core[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mebs_block_device {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)%0A          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)%0A        }%0A%0A      [32m+[0m [0menclave_options {%0A          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mephemeral_block_device {%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)%0A          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0minstance_market_options {%0A          [32m+[0m [0m[1m[0mmarket_type[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mspot_options {%0A              [32m+[0m [0m[1m[0minstance_interruption_behavior[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mmax_price[0m[0m                      = (known after apply)%0A              [32m+[0m [0m[1m[0mspot_instance_type[0m[0m             = (known after apply)%0A              [32m+[0m [0m[1m[0mvalid_until[0m[0m                    = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mmaintenance_options {%0A          [32m+[0m [0m[1m[0mauto_recovery[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mmetadata_options {%0A          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_protocol_ipv6[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)%0A          [32m+[0m [0m[1m[0minstance_metadata_tags[0m[0m      = (known after apply)%0A        }%0A%0A      [32m+[0m [0mnetwork_interface {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_card_index[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)%0A        }%0A%0A      [32m+[0m [0mprivate_dns_name_options {%0A          [32m+[0m [0m[1m[0menable_resource_name_dns_a_record[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mhostname_type[0m[0m                        = (known after apply)%0A        }%0A%0A      [32m+[0m [0mroot_block_device {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)%0A          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)%0A        }%0A    }%0A%0A[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A

::set-output name=stderr::

::set-output name=exitcode::0

<!-- Sticky Pull Request Comment -->